testCases/angleChannel/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory


# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

cp -r 0.org 0
blockMesh
VOFSetFields
rm -f 0/alphaSolid*
rm -f 0/phi*
pyroFoam

# ----------------------------------------------------------------- end-of-file
