testCases/angleChannel/constant/reactions
species
(
    N2
    EMs
    EMg
);

reactions
{

}
