testCases/angleChannel/system/VOFSetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      VOFSetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultSpecies
(
    EMg 1.0
);

liquidPhaseName alphaSolid;
vaporPhaseName  alphaGas;

shapes
(
    ChannelSide1
    {
        shape    plane;
        
        planeCoeffs
        {
            point   (0 0 0);
            normal   (-1 0.1 0);
        }
        
        delVapor 0.0;
        U        (0 0 0);
        
        liquidSpecies
        (
            EMg 1.0
        );
        
        vaporSpecies
        (
        );
    }
    
    ChannelSide2
    {
        shape    plane;
        
        planeCoeffs
        {
            point   (-0.02999 0 0);
            normal   (1 -0.1 0);
        }
        
        delVapor 0.0;
        U        (0 0 0);
        
        liquidSpecies
        (
            EMg 1.0
        );
        
        vaporSpecies
        (
        );
    }
);


// ************************************************************************* //
